// 1
// let name = "D";
// let name1 = "V";
// let name2 = "D";

// console.log(name + " " + name1 + " " + name2);

// 2
// const name = 'D';
// const name1 = 'V';
// const name2 = 'D';

// console.log(name + " " + name1 + " " + name2);

// let გაძლევთ საშუალებას გამოაცხადოთ ლოკალური ცვლადი კოდის მიმდინარე ბლოკით შემოიფარგლება.

// const ეს დეკლარაცია ქმნის მუდმივას, რომლის მასშტაბი შეიძლება იყოს გლობალური ან ლოკალური იმ ბლოკისთვის, რომელშიც ის დეკლარირებულია.

// ფუნქციის გარეთ შექმნილი var ცვლადი მოქმედებს როგორც გლობალური ცვლადი - ის ხელმისაწვდომია სკრიპტის ნებისმიერი ადგილიდან.რაც შეეხება ფარგლებს, const იქცევა როგორც ნება - მათ შორის განსხვავება არ არის.